app/Models/Model_dep.php

SELECT *
FROM `tbl_dep`
---
  public function allData() {
    return $this->db->table('tbl_dep')->get()->getResultArray();