app/Models/Model_home.php

  public function total_arsip() {
    return $this->db->table('tbl_arsip')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_arsip`

  public function total_dep() {
    return $this->db->table('tbl_dep')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_dep`

  public function total_user() {
    return $this->db->table('tbl_user')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_user`

  public function total_kategori() {
    return $this->db->table('tbl_kategori')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_kategori`