app/Models/Model_arsip.php

  public function allData() {
    return $this->db->table('tbl_arsip')
    ->join('tbl_dep', 'tbl_dep.id_dep = tbl_arsip.id_dep', 'left')
    ->join('tbl_user', 'tbl_user.id_user = tbl_arsip.id_user', 'left')
    ->join('tbl_kategori', 'tbl_kategori.id_kategori = tbl_arsip.id_kategori', 'left')
    ->get()
    ->getResultArray();
---
SELECT *
FROM `tbl_arsip`
LEFT JOIN `tbl_dep` ON `tbl_dep`.`id_dep` = `tbl_arsip`.`id_dep`
LEFT JOIN `tbl_user` ON `tbl_user`.`id_user` = `tbl_arsip`.`id_user`
LEFT JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori` = `tbl_arsip`.`id_kategori`